from itertools import groupby


class BMConsts(object):
    bm_class_list = [
        '原始红细胞', '晚幼红细胞', '淋巴细胞', '中性分叶核粒细胞', '早幼红细胞',
        '中性晚幼粒细胞', '中性中幼粒细胞', '中幼红细胞', '嗜酸性粒细胞', '嗜碱性粒细胞',
        '中性杆状核粒细胞', '原始粒细胞', '早幼粒细胞', '浆细胞', '产版型巨核细胞',
        '大颗粒淋巴细胞', '颗粒型巨核细胞', '骨髓瘤细胞', '异常早幼粒细胞', 'Burkkit细胞',
        'Smudge cell', '转移瘤细胞', '单核细胞', '淋巴瘤细胞（其他）', '戈谢细胞',
        '柴捆细胞', '异常中幼粒细胞t(8,21)', '含Auer小体细 胞', '成骨细胞', '幼稚淋巴细胞', '含Auer小体细胞'
    ]

    label_map_dict = {
        "原始红细胞": "骨髓细胞分类-红系",
        "中幼红细胞": "骨髓细胞分类-红系",
        "早幼红细胞": "骨髓细胞分类-红系",
        "晚幼红细胞": "骨髓细胞分类-红系",

        "原始粒细胞": "骨髓细胞分类-粒系",
        "早幼粒细胞": "骨髓细胞分类-粒系",
        "中性中幼粒细胞": "骨髓细胞分类-粒系",
        "中性杆状核粒细胞": "骨髓细胞分类-粒系",
        "嗜酸性粒细胞": "骨髓细胞分类-粒系",
        "嗜碱性粒细胞": "骨髓细胞分类-粒系",
        "异常早幼粒细胞": "骨髓细胞分类-粒系",
        "异常中幼粒细胞t(8,21)": "骨髓细胞分类-粒系",
        "异常嗜酸性粒细胞 inv(16)": "骨髓细胞分类-粒系",
        "中性晚幼粒细胞": "骨髓细胞分类-粒系",
        "中性分叶核粒细胞": "骨髓细胞分类-粒系",

        "原始单核细胞": "骨髓细胞分类-单核系",
        "单核细胞": "骨髓细胞分类-单核系",
        "异常单核细胞（PB）": "骨髓细胞分类-单核系",
        "幼稚单核细胞": "骨髓细胞分类-单核系",

        "原始淋巴细胞": "骨髓细胞分类-淋巴系",
        "淋巴细胞": "骨髓细胞分类-淋巴系",
        "反应性淋巴细胞": "骨髓细胞分类-淋巴系",
        "大颗粒淋巴细胞": "骨髓细胞分类-淋巴系",
        "毛细胞": "骨髓细胞分类-淋巴系",
        "套细胞": "骨髓细胞分类-淋巴系",
        "滤泡细胞": "骨髓细胞分类-淋巴系",
        "Burkkit细胞": "骨髓细胞分类-淋巴系",
        "淋巴瘤细胞（其他）": "骨髓细胞分类-淋巴系",
        "幼稚淋巴细胞": "骨髓细胞分类-淋巴系",

        "原始巨核细胞": "骨髓细胞分类-巨核系",
        "幼稚巨核细胞": "骨髓细胞分类-巨核系",
        "颗粒型巨核细胞": "骨髓细胞分类-巨核系",
        "产版型巨核细胞": "骨髓细胞分类-巨核系",
        "裸核型巨核细胞": "骨髓细胞分类-巨核系",

        "浆细胞": "骨髓细胞分类-浆细胞",
        "骨髓瘤细胞": "骨髓细胞分类-浆细胞",

        "柴捆细胞": "骨髓细胞分类-Auer小体",
        "含Auer小体细胞": "骨髓细胞分类-Auer小体",

        "成骨细胞": "骨髓细胞分类-其他细胞",
        "破骨细胞": "骨髓细胞分类-其他细胞",
        "戈谢细胞": "骨髓细胞分类-其他细胞",
        "海蓝细胞": "骨髓细胞分类-其他细胞",
        "尼曼匹克细胞": "骨髓细胞分类-其他细胞",
        "分裂象": "骨髓细胞分类-其他细胞",
        "转移瘤细胞": "骨髓细胞分类-其他细胞",
        "吞噬细胞": "骨髓细胞分类-其他细胞",

        "Smudge cell": "骨髓细胞分类-Artefacts",
        "Artefact": "骨髓细胞分类-Artefacts",

        "核异常-核出芽": "MDS病态造血-红系",
        "核异常-核间桥": "MDS病态造血-红系",
        "核异常-核碎裂": "MDS病态造血-红系",
        "核异常-多个核": "MDS病态造血-红系",
        "胞浆异常-胞浆空泡": "MDS病态造血-红系",
        "大小异常-巨幼样变-红": "MDS病态造血-红系",

        "核异常-分叶过多": "MDS病态造血-粒系",
        "核异常-分叶减少": "MDS病态造血-粒系",
        "胞浆异常-颗粒减少": "MDS病态造血-粒系",
        "胞浆异常-杜勒小体": "MDS病态造血-粒系",
        "胞浆异常-Auer小体": "MDS病态造血-粒系",
        "大小异常-巨幼样变": "MDS病态造血-粒系",

        "大小异常-微小巨核": "MDS病态造血-巨核系",
        "大小异常-单圆巨核": "MDS病态造血-巨核系",
        "大小异常-多圆巨核": "MDS病态造血-巨核系",
        "核异常-核分叶减少": "MDS病态造血-巨核系",

        "CML-侏儒状巨核": "MPN巨核细胞",
        "ET-鹿角状巨核": "MPN巨核细胞",
        "PMF-气球状巨核": "MPN巨核细胞",

        "疟原虫": "原虫及真菌",
        "利杜体": "原虫及真菌",
        "马尔尼菲青霉菌": "原虫及真菌",
        "荚膜组织胞浆菌": "原虫及真菌",

        "血小板": "血小板"
    }

    reversed_label_map_dict = {label: [kk for kk, _ in group] for label, group in groupby([(k, v) for k, v in label_map_dict.items()], lambda x: x[1])}

    label1_num_dict = {k: 0 for k in list(set(label_map_dict.values()))}

    # 细分标签
    label2_num_dict = {k: 0 for k in label_map_dict.keys()}

    label2_data_dict = {k: [] for k in label_map_dict.keys()}
